In [1]:
# DoL
topnames = {'year':[2018,2018,2017,2017,2016,2016],
           'sex':['Male','Female','Male','Female','Male','Female'],
           'name':['Liam','Emma','Liam','Emma','Noah','Emma'],
           'count':[19837,18688,18798,19800,19117,1996]}

In [8]:
print(topnames['name']) # easy to access cols
print([topnames['year'][3],topnames['sex'][3],topnames['name'][3],topnames['count'][3]]) # how about accessing say row 4?

['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma']
[2017, 'Female', 'Emma', 19800]

In [9]:
# LoL
topnames = [[2018,'Male','Liam',19837],
           [2018,'Female','Emma',18688],
           [2017,'Male','Liam',18798],
           [2017,'Female','Emma',19800],
           [2016,'Male','Noah',19117],
           [2016,'Female','Emma',19496]]

In [14]:
print(topnames[3]) # row 4 info is easy to get!
mylist=[] # how about accessing a column such as "name"?
for i in range(len(topnames)):
    mylist.append(topnames[i][2])
mylist

[2017, 'Female', 'Emma', 19800]

['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma']

In [18]:
# instead use pandas!
import pandas as pd
df = pd.DataFrame(topnames,columns=['year','sex','name','count'])
df

   year     sex  name  count
0  2018    Male  Liam  19837
1  2018  Female  Emma  18688
2  2017    Male  Liam  18798
3  2017  Female  Emma  19800
4  2016    Male  Noah  19117
5  2016  Female  Emma  19496

In [21]:
print(df['name']) # gives the name col
print(df.iloc[:,2]) # equivalently I could use column position
print(df.iloc[3,:]) # gives row 4

0    Liam
1    Emma
2    Liam
3    Emma
4    Noah
5    Emma
Name: name, dtype: object
0    Liam
1    Emma
2    Liam
3    Emma
4    Noah
5    Emma
Name: name, dtype: object
year       2017
sex      Female
name       Emma
count     19800
Name: 3, dtype: object

In [25]:
print(type(df)) # pandas dataframe object
print(type(df['name'])) # pandas series object
print(type(df[['name']])) # still a pandas dataframe object

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [28]:
df['year']*2 # works because of broadcasting because pandas is built on numpy

0    4036
1    4036
2    4034
3    4034
4    4032
5    4032
Name: year, dtype: int64